ОптоваяТорговля/src/DataProcessors/СформироватьАрхив/СформироватьАрхив.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СформироватьАрхив</name>
</mdclass:DataProcessor>

ОптоваяТорговля/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОптоваяТорговля/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОптоваяТорговля/src/DataProcessors/СформироватьАрхив/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Готовит архив, содержащий список номенклатуры и файлы фотографий
// 
// Возвращаемое значение:
//  Строка -  Адрес временного хранилища с архивом
Функция ПодготовитьАрхив()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СпрНоменклатура.Ссылка)) КАК Идентификатор,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.Ссылка) КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ТипНоменклатуры) КАК ТипНоменклатуры,
		|	СпрНоменклатура.Фото КАК Фото,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = СпрНоменклатура.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	
	ОписаниеНоменклатуры = Новый Массив;
	
	ШаблонИмениКартинки = "%1%2%3";
	
	Пока Выборка.Следующий() Цикл
		
		Описание = Новый Структура;
		Описание.Вставить("Идентификатор", Выборка.Идентификатор);
		Описание.Вставить("Номенклатура", Выборка.Номенклатура);
		Описание.Вставить("ТипНоменклатуры", Выборка.ТипНоменклатуры);
		Описание.Вставить("Цена", Выборка.Цена);
		
		ДанныеФото = Выборка.Фото.Получить();
		
		Если ДанныеФото = Неопределено Тогда
			Описание.Вставить("Фото", Неопределено);
		Иначе
			ИмяФайла = СтрШаблон(ШаблонИмениКартинки, ИмяКаталога, ПолучитьразделительПути(), 
				Выборка.Идентификатор);
			ДанныеФото.Записать(ИмяФайла);
			Описание.Вставить("Фото", СтрШаблон(ШаблонИмениКартинки, "", ПолучитьразделительПути(),
				 Выборка.Идентификатор));
		КонецЕсли;
		
		ОписаниеНоменклатуры.Добавить(Описание);
		
	КонецЦикла;
	
	ШаблонИмениВыгрузки  = "%1%2export.json";
	
	ИмяФайлаВыгрузки = СтрШаблон(ШаблонИмениВыгрузки, ИмяКаталога, ПолучитьРазделительПути());
	
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеНоменклатуры);
	Запись.Закрыть();
	
	Архиватор = Новый ЗаписьФайлаАрхива;
	Архиватор.Добавить(ИмяКаталога + ПолучитьРазделительПути() + "*.*",,
		 РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();
	
	УдалитьФайлы(ИмяКаталога);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеАрхива);
	
КонецФункции
#КонецОбласти

#КонецЕсли
